Revit 2026 API

# CurveElementCenterPointReference Property

---

Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference CenterPointReference { get; }
```
```vb
Public ReadOnly Property CenterPointReference As Reference
	Get
```
```cpp
public:
property Reference^ CenterPointReference {
	Reference^ get ();
}
```
```fsharp
member CenterPointReference : Reference with get
```

#### Property Value

Reference

Use this reference property when using the API to dimension between centerpoints of curves.

#### Reference

CurveElement Class

Autodesk.Revit.DB Namespace